[
    {
        "Position": "Machine Learning Research Engineer x 3 at SaaSlife",
        "Company": "Global Path Consulting Services LLC",
        "Location": "San Francisco, CA",
        "Salary": "$130,000 - $200,000 a year",
        "url": "https://www.simplyhired.com/job/o9ZJNHbAwRZfEC-aNGuvJa7VG3Xl1249AbweKkwxF92HTH1hKnQ7cw",
        "Job_Description": "Machine Learning Research Engineer x 3 at SaaSlife\nGlobal Path Consulting Services LLC\nSan Francisco, CA\nQuick Apply\nJob Details\nFull-time\n$130,000 - $200,000 a year\n8 days ago\nQualifications\nPyTorch\nMid-level\nMachine learning\n2 years\nFull Job Description\nAn AI lab based in San Francisco, currently with a team of around 15 people, is seeking 3x Machine Learning Research Engineers to join their cutting-edge team. The lab is working on innovative AI projects that would rival even the top tech companies, like Google. With over $20 million in funding, the company is well-positioned for significant breakthroughs in the field of machine learning. This is a unique opportunity for talented Machine learning specialists to work on groundbreaking projects and make an impact in a highly innovative environment.\nResponsibilities\nTrain machine Learning models\nBuild an RLAIF pipeline for search capabilities\nSee where your imagination takes you! dream of a new novel architecture - great! code it up and see how it competes against existing models!\n\nRequirements\n2 - 15 years of commercial experience in a ML role (experience is great to see, but excitement and startup orientation is more important than experience.\nCan code up a transformer from scratch in pytorch\nComfortable creating large-scale datasets\nCare about the problem of finding high quality knowledge and recognize how important this is for the world\nGraduate-level ML experience at a top tier university (proof of grades required)\nQuick Apply"
    },
    {
        "Position": "ML Engineer L5 - Ads Platform Engineering (Forecasting)",
        "Company": "Netflix",
        "Location": "Remote",
        "Salary": "$100,000 - $720,000 a year",
        "url": "https://www.simplyhired.com/job/AQfKXq6UQ156n7ePt0GQyUaCIEbgqAFKTRj3SXx32t2ZQCv21z5d_g",
        "Job_Description": "ML Engineer L5 - Ads Platform Engineering (Forecasting)\nNetflix - 3.9\nRemote\nApply Now\nJob Details\nFull-time\n$100,000 - $720,000 a year\nBenefits\nStock options\nPaid holidays\nHealth insurance\nFlexible spending account\nPaid time off\n401(k) matching\nQualifications\nMid-level\nMachine learning\nMetadata\nFull Job Description\nJob Requisition ID\nJR29684\nJob Posting Date\n09-09-2024\nTeams\nData Science & Analytics\nWork Type\nRemote\nNetflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\nThe Role\nNetflix is one of the world's leading entertainment services with over 260 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\nIn April 2022, we introduced a new, more affordable, ad-supported tier for our customers, marking a significant milestone for Netflix. Our focus is now on expanding choices for consumers and providing advertisers with a premium TV brand experience that surpasses traditional linear formats. The challenge ahead involves scaling our ad tech to maximize its impact on our business.\nOur Team\nThe Ads Platform Engineering teams build advertising systems and integrations that powers the delivery of ads using our world-class content delivery ecosystem. We use a number of Netflix investments and innovations to power our ads - unique mix of client and server-side ad insertions, state of the art content delivery system, ad encoding recipes, content understanding and metadata. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. We also ensure that advertiser brand safety is ensured during serving, members only see the most appropriate ads for them.\nOur team is new and yet faced with the enormous ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.\nWe are looking for highly motivated engineers working in the advertising space who are excited to join us on this journey.\nExperience & Skills:\nWe are seeking an ML engineer with experience in the following areas:\nProductionize models to forecast ad inventory availability and performance. This includes predicting future inventory needs based on historical data, market trends, and seasonal variations.\nProductionized predictive models to forecast the effectiveness of advertising campaigns, including metrics like clicks, impressions, conversions, and ROI.\nBringing complex models to life in low-latency real-time advertising environments\nBuilding Scalable Simulation solution to model different inventory scenarios, including demand fluctuations, pricing strategies, and inventory allocation.\nBudgeting and Pacing systems, models, and algorithms\nApplying Modeling and machine learning techniques for business problems at the intersection of product, data science, and engineering\nCollaborate with cross-functional stakeholders from science team, product, engineering, operations, design, consumer research, etc., to productionize and deploy models at scale\nNice to Haves:\nPublisher-side ad tech systems including ad servers, bidders, yield optimizers, and their demand-side counterparts (SSPs/DSPs)\nYield Optimization, scoring, and bid ranking models and Dynamic Allocation of direct/programmatic guaranteed and non-guaranteed inventory\nContributed to an ads industry technology standard (e.g VAST, OpenRTB) or worked on an industry consortium effort, or working group.\nFamiliarity with legal compliance and the changing landscape of ad regulations around the world.\nExperience working in the CTV space and knowledge of its unique constraints\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\nNetflix is a unique culture and environment. Learn more here.\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\nJob is open for no less than 7 days and will be removed when the position is filled.\nApply Now"
    },
    {
        "Position": "Sr. ML Ops Engineer",
        "Company": "Deep 6 AI",
        "Location": "Pasadena, CA",
        "Salary": "$160,000 - $190,000 a year",
        "url": "https://www.simplyhired.com/job/W__tEkADeWsfFqJy30-XlcgmgKCOmDzE9y_3cTAYwKRRyK_b8bp9yw",
        "Job_Description": "Sr. ML Ops Engineer\nDeep 6 AI\nPasadena, CA\nApply Now\nJob Details\nFull-time\n$160,000 - $190,000 a year\n1 day ago\nBenefits\nDisability insurance\nHealth insurance\nDental insurance\n401(k)\nPaid time off\nVision insurance\nLife insurance\nQualifications\nLucene\nTensorFlow\nCI/CD\nData modeling\nSignal processing\nPyTorch\nDocker\nMachine learning\nDeep learning\nNatural language processing\nModel training\nKeras\nSenior level\nAI\nLinguistics\nFull Job Description\nDeep 6 AI is a fast-growing tech startup headquartered in Los Angeles, California looking for talented, dynamic team members who want to help shape our groundbreaking artificial intelligence platform.\nWe are transforming and accelerating clinical trials, to help get life-saving treatments to patients faster and accelerate innovation in healthcare. To that end, we build a cutting-edge software suite that connects all clinical research stakeholders, from research teams to treating physicians, patients, and study sponsors on a real-time, real-world data SaaS platform, powered by AI.\nWhat You'll Do\nDevelop and Maintain ML Pipelines: Design, implement, and manage scalable machine learning pipelines to support various ML models from development to production.\nAutomate Workflows: Create automated workflows for data preprocessing, model training, evaluation, and deployment.\nMonitor and Optimize: Continuously monitor the performance of ML models in production, ensuring they meet performance and accuracy standards. Optimize models and pipelines for efficiency.\nCollaborate with Teams: Work closely with data scientists, software engineers, and other stakeholders to integrate ML solutions into existing systems and applications.\nEnsure Compliance and Security: Implement best practices for data security and compliance, ensuring that all ML operations adhere to relevant regulations and standards.\nDocumentation and Reporting: Maintain comprehensive documentation of ML processes, workflows, and systems. Provide regular reports on model performance and system health.\n\nAbout You\nDeep knowledge of traditional ML concepts (e.g., LSTMs, RNNs, GMMs, SVMs, trees, boosting) as well as more recent deep learning fundamentals and NLP-related experience with word embeddings\nProficiency in JVM languages\nFamiliarity with CI/CD tools and methodologies\nProficiency with containerization (e.g., Docker) and orchestration tools\nExperience with cloud-based ML platforms (e.g., Amazon Sagemaker)\nExperience with common JVM search, linguistics, and other language frameworks (e.g., Lucene, StanfordNLP, OpenNLP, SparkNLP, ANTLR)\nExperience using a Deep Learning Framework (e.g., Tensorflow, PyTorch, Keras)\nMature theoretical grasp of different neural networks on large-scale datasets\nDeep and Fundamental understanding in signal processing concepts\nA positive, collaborative, can-do attitude and a strong sense of ownership.\nFamiliarity with clinical data, concepts and language\nExperience in model training automation with a combination of Supervised, Unsupervised, and Reinforcement methods\nBonus Points\nPrior remote working experience.\nWorked in the healthcare domain. Experience with healthcare clinical data modeling a strong bonus (e.g., OMOP, FHIR)\nExperience with Transfer Learning, Transformers (e.g., BERT & ELMO), and Multilingual NLP\nFamiliarity with performance and load testing automation tools (e.g., Gatling, K6, Jmeter) and methodologies\n$160,000 - $190,000 a year\nOur Culture\nWe are a very collaborative group that is inclusive, fun, and hard-working. We appreciate the value in diverse backgrounds and experiences so that we can create the best product through different perspectives and ideas. Deep 6 AI welcomes remote work and has fully-remote teams throughout the country; we strive to create an environment where you can do your best work in the environment and location that is best suited for each individual. As a member of our team, you can expect to work with intelligent, curious, and motivated peers who value and respect your perspectives. Deep 6 AI is headquartered in Los Angeles and has employees nationwide.\nBenefits\nIn addition to competitive salary and a unique opportunity to thrive at a growing company, Deep 6 AI offers various formal benefits as well as a generous PTO plan which includes sick and vacation days, and as well as employer-paid medical, dental, vision, life insurance and long-term disability coverage. A 401k plan is available, too.\n\nThe above statements describe the general nature and level of work being performed in this job function. They're not intended to be an exhaustive list of all duties, and indeed additional responsibilities may be assigned by Deep 6.\nAt Deep 6, we appreciate the opportunity to benefit from the diverse backgrounds and experiences of others. Because of our deep commitment to respect every individual, Deep 6 is an equal opportunity employer.\nApply Now"
    },
    {
        "Position": "Gen AI/ML Engineer",
        "Company": "Ccube",
        "Location": "Atlanta, GA",
        "Salary": "$65 - $75 an hour",
        "url": "https://www.simplyhired.com/job/0RSzSQ0O3uVrZs_1QLCwRgaJ6E_eITRzKtXuCRY7p2xc5Dy-cffnHQ",
        "Job_Description": "Gen AI/ML Engineer\nCcube - 3.0\nAtlanta, GA\nQuick Apply\nJob Details\nFull-time\n$65 - $75 an hour\n13 days ago\nBenefits\nHealth insurance\nDental insurance\nVision insurance\nQualifications\n6 years\nLaw\nPyTorch\nBash\nMachine learning\nOCR\nData pipelines\nData science\nSenior level\nAI\nGroovy\nMachine learning frameworks\nPython\nShell Scripting\nSDLC\nFull Job Description\nHello All,\nWe are Hiring Gen AI/ML Engineer in Atlanta GA.\nBelow is the JD for the reference\n\nGen AI/ML Engineer\nAtlanta, GA (3 Days a week onsite)\nW2/FT Preferred\n*** Local Candidates Highly Preferred***\nExperience : 8+ yrs\nNeed AI/ML Engineer with Strong Deep Learning & Python\nPython\nMachine learning (Modeling and Deep Learning)\nOCR - experience of building optical character recognition (OCR) in Python\nLLM - Hands-on experience of Python library for interacting with Large Language Models\nLangChain - knowledge and experience of LangChain an open-source framework to create applications using large language models (LLMs)\nStrong Programming skills in Python, Bash, Groovy and software engineering principles\nPassionate about building an innovative and team centric culture\nKnowledge of industry-wide technology trends and best practices\nAbility to work in large, collaborative teams to achieve organizational goals\n\nSpecific Requirements (Mandatory)\nProven experience as a Data Scientist or Machine Learning Engineer or similar role for a minimum of 6+ years.\nExpert level experience in Data Science & ML SDLC, developing and deploying Python models and applications\nExperience monitoring model performance, and retraining redeploying ML models\nFamiliarity with machine learning frameworks (like LangChain and PyTorch etc.) and libraries (like LLMs, scikit-learn etc.\nFamiliarity with data pipelines, monitoring and model performance tuning.\n\nBenefits & Perks:\nPart of our mission statement is to provide a great life for our employees. We believe that happy employees make for a better company, so we take care of them. Here are a few of the perks we offer:\nFlexibility for you to work in-office, hybrid or remote\nMedical and Dental Premiums\nStartup culture with opportunity to grow\nPerformance bonuses\nHealth, dental and vision insurance plans\nPursue growth and learning with career development expenses\nWs3kvbocbA\nQuick Apply"
    },
    {
        "Position": "Partner 20, ML Ops Engineer",
        "Company": "a16z",
        "Location": "San Francisco, CA",
        "Salary": "$225,000 - $263,000 a year",
        "url": "https://www.simplyhired.com/job/BwVxiQZ8gONDsz2yvxPPsxIvSDst3kQY6sxJNjP3WitoaQlYeHXjHA",
        "Job_Description": "Partner 20, ML Ops Engineer\na16z\nSan Francisco, CA\nQuick Apply\nJob Details\n$225,000 - $263,000 a year\nBenefits\nDisability insurance\nDental insurance\n401(k)\nVision insurance\nLife insurance\nQualifications\nLooker\n6 years\nSQL\nAWS\nDocker\nMachine learning\nModel deployment\nGitHub\nSenior level\nAI\nFigma\nCommunication skills\nPython\nMLOps\nGenerative AI\nFull Job Description\nPartner 20, ML Ops Engineer\nFounded in Silicon Valley in 2009 by Marc Andreessen and Ben Horowitz, Andreessen Horowitz (aka a16z) is a venture capital firm that backs bold entrepreneurs building the future through technology. We are stage agnostic. We invest in seed to venture to growth-stage technology companies, across AI, bio + healthcare, consumer, crypto, enterprise, fintech, games, and companies building toward American dynamism. a16z has $44B in assets under management across multiple funds.\nWe've established a team that is defined by respect for the entrepreneur and the company-building process; we know what it's like to be in the founder's shoes. We've invested in companies like Affirm, Airbnb, Coinbase, Databricks, Devoted Health, Insitro, Figma, GitHub, Instacart, OpenSea, Roblox, Stripe, and Substack. Our team is at the forefront of new technology, helping founders and their companies impact and change the world.\nThe Role\nAt a16z, we believe data is at the core of making informed decisions and effectively supporting our portfolio companies. Our Data & Analytics team builds and manages the infrastructure that supports our data lake (Databricks), data pipelines (dbt), data ingestion (Fivetran & custom Python scripts), and data visualizations (Looker/Hex). We leverage cutting-edge GenAI alongside more traditional data & analytics to empower our firm.\nAs an ML Ops Engineer, you will play a critical role in developing and optimizing our machine learning & large language model infrastructure in Databricks. You will work on accelerating and hardening our GenAI projects by building scalable, efficient, and secure MLOps pipelines. This role requires technical expertise in machine learning operations, a strong understanding of data infrastructure, and the ability to work collaboratively with cross-functional teams.\nTo join our team, you should be excited to:\nDesign, implement, and maintain scalable and robust MLOps pipelines in Databricks to support GenAI projects\nDevelop and optimize infrastructure to accelerate the deployment and monitoring of machine learning models\nCollaborate with analytics engineers to streamline the end-to-end machine learning workflow, from data ingestion to model deployment\nImplement best practices for model versioning, testing, and validation to ensure the reliability and accuracy of deployed models\nMonitor and maintain the performance, security, and scalability of the machine learning infrastructure\nDevelop automation scripts and tools to improve the efficiency and reliability of MLOps processes\nStay current with the latest trends and technologies in machine learning, MLOps, LLMOps, and recommend improvements to our existing infrastructure\nProvide technical guidance and support to team members and stakeholders on MLOps best practices\nMinimum Qualifications\n6+ years of experience in machine learning operations, data engineering, or a related field\nAdvanced proficiency in Python and SQL\nStrong understanding of machine learning concepts and experience with deploying ML models in a production environment\nProven experience in designing and implementing MLOps pipelines and infrastructure\nFamiliarity with cloud platforms and services, particularly those related to data and machine learning\nExcellent problem-solving skills and the ability to work independently in a fast-paced environment\nStrong communication skills and the ability to collaborate effectively with cross-functional teams\nKnowledge of containerization technologies such as Docker\nLow ego, high empathy, and the capacity to collaborate effectively with diverse teams\nExperience using Databricks and AWS preferred\nExperience with GenAI projects and understanding of generative AI concepts and methodologies preferred\nThe anticipated salary range for this role is between $225,000-$263,000, actual starting pay may vary based on a range of factors which can include experience, skills, and scope.\nThis role is eligible to participate in the a16z Carry program and various discretionary bonus programs as well as benefit and perquisite plans including health, dental, vision, disability, life insurance, 401K plan, vacation, and sick leave.\na16z culture\nWe do only first class business and only in a first class way\nWe take a long view of relationships, because we are in the relationship business\nWe believe in the future and bet the firm that way\nWe are all different, we recognize that, and we win\nWe celebrate the good times\nWe do it for the team\nWe play to win\nAt a16z we are always looking to hire the absolute best talent and recognize that diversity in our experiences and backgrounds is what makes us stronger. We hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, Veteran status, and any other status. These differences are what enables us to work towards the future we envision for ourselves, our portfolio companies, and the World.\nOur organization participates in E-Verify. Click here to learn about E-Verify.\nAndreessen Horowitz hereby reserves the right to make use of any unsolicited resumes received from outside recruiting agencies and / or individual recruiters without being responsible for payment of any fees asserted from the use of unsolicited resumes.\nQuick Apply"
    },
    {
        "Position": "AI/ML Engineer",
        "Company": "General Technical Services, LLC",
        "Location": "Adelphi, MD",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/y-5yWHc0G5ve4ehmtHd0xPeCCLkv6qEFe4wjJ27pTspKCrOTmO0F0g",
        "Job_Description": "AI/ML Engineer\nGeneral Technical Services, LLC - 4.0\nAdelphi, MD\nQuick Apply\nJob Details\nFull-time\nEstimated: $144K - $182K a year\nBenefits\nHealth savings account\nRelocation assistance\nHealth insurance\nDental insurance\n401(k)\nFlexible spending account\nTuition reimbursement\nPaid time off\nVision insurance\n401(k) matching\nProfessional development assistance\nFlexible schedule\nLife insurance\nRetirement plan\nQualifications\nTensorFlow\nResearch laboratory experience\nReinforcement learning\nDoctoral degree\nPyTorch\nComputer vision\nSoftware deployment\nSecret Clearance\nPrompt engineering\nMaster's degree\nGPS\nAlgorithms\nC++\nMachine learning\nDoctor of Philosophy\nObject detection\nNatural language processing\nOpenCV\nUnity\nRobot programming\nSenior level\nElectrical Engineering\nAI\nRobotics\nRobotics\nCommunication skills\nSensors\nPython\nFull Job Description\nAI/ML Research Scientist Engineer\nBecause this position requires the ability to obtain a security clearance, US Citizenship is mandatory.\nThe Army Research Laboratory is seeking an AI/ML engineer or data scientist with additional knowledge about robotics, computer vision, and hardware integration. The goal is for this person to transit between University of Maryland, College Park and The Army Research Laboratory seamlessly, hence US Citizenship and an ability to obtain and retain a SECRET clearance will be required.\nJob Description:\nThis research focuses on advancing the state-of-the-art in autonomous robotics, computer vision, and their integration with a variety of robotic platforms, including legged and aerial systems. This work involves developing novel algorithms, software frameworks, and hardware systems for real-time operation in dynamic and complex environments. We aim to build solutions for applications such as autonomous navigation, multi-robot collaboration, and human-robot interaction. We are seeking a motivated research scientist or engineer with expertise in robotics and computer vision to contribute to cutting-edge projects in this domain. The role will involve collaboration with a multidisciplinary team of researchers, integration of advanced sensors, and working with both simulated and real-world robotic systems.\nTasks/Duties/Responsibilities:\nDevelop and implement algorithms for autonomous robotic systems, focusing on real-time control, perception, and decision-making in dynamic environments.\nDesign and optimize motion planning and navigation systems for robots, particularly legged and aerial platforms, for tasks such as obstacle avoidance, path optimization, and multi-robot coordination.\nIntegrate vision-based perception systems for robots, including stereo vision, LIDAR, and depth cameras, to enable environment understanding, object detection, action recognition and visual-based localization.\nDevelop novel vision-based algorithms for robot navigation, localization and human-robot interaction. Utilize state-of-the-art vision language models to introduce zero shot capabilities, explainability, scene understanding and context-sensitivity. Deploy generative models for data augmentation.\nCollaborate on the design and testing of hardware for robotic systems, including sensors (IMUs, GPS, LIDAR, RGB-D cameras) and actuators, with a focus on robust, field-ready deployment.\nWork with the Robot Operating System (ROS2) for seamless integration of perception, planning, and control modules, and lead efforts in developing ROS2-based simulation environments.\nContribute to the development of machine learning models for perception and decision-making, such as object classification, scene understanding, and behavior prediction using computer vision techniques.\nPerform experiments and collect field data to validate system performance, including the use of simulation platforms such as Gazebo or Unreal/Unity-based environments as well as field deployment on physical robots.\nSkills and Knowledge:\nAutonomous Robotic Systems:\nExperience with robot architecture, decision-making algorithms, and real-time control systems for both ground and aerial robots.\nKnowledge of multi-robot systems and collaborative behaviors (e.g., swarm robotics, autonomous UAV fleets).\nPlanning and Navigation:\nProficiency in motion planning algorithms (e.g., RRT, A*, D*), trajectory optimization, and navigation in unstructured, GPS-denied environments.\nExperience in Simultaneous Localization and Mapping (SLAM), Visual SLAM (V-SLAM), or GPS-integrated localization strategies.\nComputer Vision:\nExpertise in computer vision techniques, including deep learning approaches for image recognition, object tracking, and 3D scene reconstruction.\nFamiliarity with OpenCV, PyTorch/TensorFlow, or similar frameworks for developing and deploying vision algorithms in real-time robotic systems.\nLarge Language Models:\nProficiency with fine-tuning and prompt engineering for vision-language models and other transformer-based vision models.\nFamiliarity with transformers for natural language understanding.\nFamiliarity with ROS2, Sensors, and Hardware Integration:\nStrong experience with ROS2 (Robot Operating System) for robotic middleware, including ROS2 for communication, sensor fusion, and hardware abstraction layers.\nHands-on experience integrating a variety of sensors (e.g., LIDAR, depth cameras, IMUs) and interfacing them with robotic platforms.\n- Helpful, but not required: Understanding of hardware design, including robotic actuators, communication interfaces (e.g., CAN, UART, I2C), and embedded system integration.\n- Helpful, but not required: Understanding of reinforcement learning.\nWork Experience Desired:\nMS (minimum) or Ph.D. (preferred) in Robotics, Computer Science, Electrical Engineering, or a related field.\nStrong programming skills in C++, Python, and familiarity with ROS2.\nHands-on experience with robotic platforms and sensors.\nExcellent communication skills and the ability to work in a collaborative team environment.\nFamiliarity with the Pytorch and HuggingFace transformers libraries.\nCompetitive pay commensurate with education and experience.\nThe selected candidate will be an employee of General Technical Services LLC (GTS).\nUS citizenship is mandatory (to obtain the required security clearance). There may be occasional travel. GTS offers company-funded educational support for job-related training. Other benefits include eleven (federal) holidays, a co-funded medical plan, fifteen days of personal time, and a 401(k) investment package.\nBackground: Located in Adelphi, MD, the U.S. Army Research Laboratory's (ARL) Army Research Directorate (ARD) is the principal Army organization for research and development in sensors and electron devices. ARD conducts innovative research to provide the Army with affordable enabling technology in sensors, electronic warfare (EW), Quantum information sciences, position navigation and timing (PNT), Systems Biology, and Energy & Power. ARD coordinates technologies within the Army, other services and their laboratories, industry, and academia to leverage basic and applied research opportunities for the benefit of the Army. Please visit https://www.arl.army.mil/who-we-are/ and select “Read more” under Army Research Directorate.\nTo accomplish its mission ARD utilizes several unique facilities, most notably the Zahl Physical Science Laboratory, a 349,000 square foot state-of-the-art electronics R&D facility. This building has a 15,000 square foot clean room, dry room, high energy laser facilities, bio-inspired sensor laboratories and other research & development infrastructure.\nJob Type: Full-time\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nProfessional development assistance\nRelocation assistance\nRetirement plan\nTuition reimbursement\nVision insurance\nSchedule:\nMonday to Friday\nEducation:\nMaster's (Preferred)\nExperience:\nAI/ML: 3 years (Preferred)\nLicense/Certification:\nUS Citizenship (Required)\nSecurity clearance:\nSecret (Preferred)\nWork Location: In person\nQuick Apply"
    },
    {
        "Position": "AI-ML Engineer",
        "Company": "Intone Networks",
        "Location": "Charlotte, NC",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/J7AjxAkOrRyQVG0jRuDRGlSM_pum0pQCPoE-WbJAS4ycbnAWf2CJ7w",
        "Job_Description": "AI-ML Engineer\nIntone Networks - 4.1\nCharlotte, NC\nApply Now\nJob Details\nContract\nEstimated: $112K - $142K a year\nQualifications\nSenior level\nAI\nFull Job Description\nAI-ML Engineer Generative AI & Traditional AI Platform Capabilities on enterprise on-prem and cloud platforms. 100% onsite role.\nApply Now"
    },
    {
        "Position": "Lead ML/AI Engineer",
        "Company": "Children's National Hospital",
        "Location": "Silver Spring, MD",
        "Salary": "$164,071 - $273,451 a year",
        "url": "https://www.simplyhired.com/job/Y2Ye0o_RxOxhUe56fF-re99hfM7_Xnqm23dGzUf9zMH8ykJbzhts_A",
        "Job_Description": "Lead ML/AI Engineer\nChildren's National Hospital - 3.8\nSilver Spring, MD\nApply Now\nJob Details\nFull-time\n$164,071 - $273,451 a year\n13 days ago\nQualifications\nAI models\nStatistics\nComputer science\nC#\nR\nJava\nDatabase design\nAnalysis skills\nProject management\nBachelor's degree\nMachine learning\nJavaScript\nContinuous integration\nOpenCV\nPredictive analytics\nLinux\nSenior level\nAI\nCommunication skills\nPython\n10 years\nFull Job Description\nDescription\nAs a Lead Machine Learning/AI Engineer, you will spearhead strategic initiatives and oversee the end-to-end development of cutting-edge AI and machine learning solutions. You will be responsible for defining project scopes, setting technical direction, and ensuring the successful delivery of complex models and systems. Your role involves leading cross-functional teams, managing high-impact research and development efforts, and driving innovation within the organization. You will also be responsible for optimizing and integrating large-scale data architectures, addressing critical performance issues, and ensuring the seamless deployment and operational excellence of machine learning solutions. Additionally, you will play a key role in shaping the technical vision and strategy of the team or department.\nQualifications\n\nMinimum Education\nBachelor's Degree A Bachelor’s degree in a quantitative or business field (e.g., Statistics, Mathematics, Engineering, Computer Science). (Required)\nMinimum Work Experience\nRequires deep functional knowledge with 10 years of related experience, or equivalent experience acquired through accomplishments of applicable knowledge, duties, scope and skill reflective of the level of this position. (Required)\n\nRequired Skills/Knowledge\nExperience with C# (programming language; Database Design; Java (Programming Language); JavaScript (Programming Language); Machine Leaning Machine Learning Algorithms; Python (Programming Language); R (Programming Language); Software Engineering; SWL (Programming Language); Statistics\nExperience with Continuous Integration; Predictive Modeling\nExperience with compute clouds, creating database schemas, continuous deployment\nExperience with building ML/AI models using common methods withing R and Python\nKnowledge of Open CV Linux\nSeeks to acquire knowledge in area of specialty.\nAbility to identify basic problems and procedural irregularities, collect data, establish facts, and draw valid conclusions.\nAbility to work independently.\nDemonstrated analytical skills.\nDemonstrated project management skills.\nDemonstrates a high level of accuracy, even under pressure.\nDemonstrates excellent judgment and decision-making skills.\nAbility to communicate and make recommendations to upper management.\nAbility to drive multiple projects to successful completion.\nPossesses technical aptitude.\nExcellent verbal and written communication skills, communicate complex findings in a clear and understandable manner\nExcellent facilitation ability to host sessions and elicit ideas from others, understanding their issues and encourage group participation\nAttention to detail.\nCommunicate complex findings in a clear and understandable manner\nCollaborate effectively with cross-functional teams\nAdapt to changing priorities and thrive in a dynamic environment\n\n\nFunctional Accountabilities\n\nLeads the design, development, and research around complex Machine Learning (ML) systems, models, and schemes to apply to appropriate datasets for data modeling and statistical analysis\nIdentifies differences and complex use cases of ML algorithms and apply findings to enable business decisions by deriving insights through data visualization\nLeads the maintenance and support of ML/AI software platforms by reviewing and solving issues and running ML/AI models\nCommunicates business objectives and develops complex models that help to achieve them, along with metrics to track progress\nLeads the writing of complex software documentation and complex software code to extract data from a variety of databases and data sources\nManages available resources such as hardware, data, and personnel so that the deadlines are met and deploy predictive models using established software patterns\nLeads the analysis of the ML algorithms that could be used to solve a given problem and rank them by their success probability.\nExplores and visualizes data to gain an understanding of it and verify data quality, and/or ensure data quality via data cleaning\nAnalyses errors of the model and implements strategies to overcome errors\nPerforms other duties as assigned.\nComplies with all policies and standards\n\n\nOrganizational Accountabilities\nAnticipate and responds to customer needs; follows up until needs are met\n\n\nTeamwork/Communication\nDemonstrate collaborative and respectful behavior\nPartner with all team members to achieve goals\nReceptive to others’ ideas and opinions\n\n\nPerformance Improvement/Problem-solving\nContribute to a positive work environment\nDemonstrate flexibility and willingness to change\nIdentify opportunities to improve clinical and administrative processes\nMake appropriate decisions, using sound judgment\n\n\nCost Management/Financial Responsibility\nUse resources efficiently\nSearch for less costly ways of doing things\n\n\nSafety\nSpeak up when team members appear to exhibit unsafe behavior or performance\nContinuously validate and verify information needed for decision making or documentation\nStop in the face of uncertainty and takes time to resolve the situation\nDemonstrate accurate, clear and timely verbal and written communication\nActively promote safety for patients, families, visitors and co-workers\nAttend carefully to important details - practicing Stop, Think, Act and Review in order to self-check behavior and performance\nPrimary Location: Maryland-Silver Spring\nWork Locations: Inventa Towers 1 Inventa Place Silver Spring 20910\nJob: Information Technology\nOrganization: Operations\nPosition Status: R (Regular) - FT - Full-Time\nShift: Day\nWork Schedule: 8-5\nJob Posting: Oct 10, 2024, 7:34:55 AM\nFull-Time Salary Range: 164071 - 273451\nApply Now"
    },
    {
        "Position": "Staff ML Engineer",
        "Company": "Xero",
        "Location": "Los Angeles, CA",
        "Salary": "$150,000 - $195,000 a year",
        "url": "https://www.simplyhired.com/job/g9_Q-T2T1kjdbVZbOTZ3jdjfEGX7UAEBpUXb8_IqxytqupfJ0nA7SA",
        "Job_Description": "Staff ML Engineer\nXero - 4.3\nLos Angeles, CA\nApply Now\nJob Details\n$150,000 - $195,000 a year\n1 day ago\nBenefits\nPaid parental leave\nDisability insurance\nHealth insurance\nDental insurance\nParental leave\nEmployee assistance program\nVision insurance\n401(k) matching\nQualifications\nTensorFlow\n6 years\nSystem design\nXero\nSQL\nMentoring\nSenior level\nAI\nCommunication skills\nPython\nFull Job Description\nXero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive.\n\nAt Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place.\n\nThe AI team at Xero brings together ML Engineers and Applied Scientists to build systems that power Xero's next generation of beautiful, insightful products.\n\nAbout The Team\n\nThe AI Products group exists to collaboratively build products that use AI and ML to reduce toil and deliver the right insight at the right time. Working within the Data & Science team, you will join a diverse, globally distributed team of scientists, engineers, product managers, and analysts who help Xero turn data into beautiful, insightful products.\n\nML engineers design and build the infrastructure and services that power AI products that serve millions of customers every day. They also work closely with Applied Scientists through the research and development process to create harnesses and interfaces to safely take models from research to production environments. As a Staff ML Engineer, you will lead delivery programs and co-lead research programs that push the boundaries of what's possible with today's technology.\nAbout The Role\nLeading the design of our AI research and production infrastructure and services, ensuring that our services scale while preserving flexibility for research teams\nOwning our strategy for managing the growth rate of technical debt and costs across our stack\nMaking sure we're solving the right problems with the right methods\nSharing knowledge with colleagues and lifting the bar for the AI Products team\nWorking with teams across Xero to improve the quality and usability of data\nBuilding Xero's profile in market through public facing content and events\nAbout You\nYou have 6+ years of experience delivering ML and AI products at scale\nYou are drawn to solving hard problems and understanding how things work\nYou are comfortable learning new frameworks (distributed processing, ML, etc) and applying them to real problems\nYou are willing to dive into the unknown, and allow new information to change your decisions\nConstant learning and growth are an important part of who you are\nYou are always willing to learn from others and ask for help\nWhat you’ll Bring With You\nStrong coding and system design skills in Python or another language used in web scale data and AI applications\nStrong SQL skills and understanding of distributed processing (data, ML, etc)\nExcellent written and verbal communication skills for communicating technical concepts to technical and business stakeholders\nExperience developing sensible standards and mentoring early career ML engineers\nFamiliarity with Tensorflow is a nice to have\n$150,000 - $195,000 a year\n\nWhy Xero?\nDiversity of people brings diversity of thought, and we like that. Our human-first culture of respect, fairness, and inclusion is what helps Xeros thrive and work and beyond. Offering very generous paid leave to use however you’d like (plus statutory holidays!), dedicated paid leave to care for your physical and mental wellbeing as well as an Employee Assistance Program to access mental health care for you and your family, employee resource groups, wellbeing programming and allowances, medical, dental, vision, and disability insurance, fertility and family forming financial support, 401k contribution matching, 26 weeks of paid parental leave for primary caregivers, an Employee Share Plan, beautiful offices with snacks and break areas, flexible working, career development and many other benefits that reflect our human value, you’ll do the best work of your life at Xero.\n\nResearch has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single competency or experience. If you are excited about this role, but your past experience doesn't align perfectly, we encourage you to apply anyway. You could be just the right person for this role and Xero. If you have any support or access requirements, we encourage you to advise us at time of application and throughout the interview process.\nApply Now"
    },
    {
        "Position": "Senior BI Engineer",
        "Company": "General Motors",
        "Location": "Remote",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/gGxorYYp4rtyQJsQCPZf3DQwVHDXfO5xUyvoiCgGkF_2U_akwO_ikQ",
        "Job_Description": "Senior BI Engineer\nGeneral Motors - 4.0\nRemote\nApply Now\nJob Details\nFull-time\nEstimated: $119K - $150K a year\n1 day ago\nBenefits\nHealth savings account\nPaid holidays\nHealth insurance\nDental insurance\n401(k)\nFlexible spending account\nTuition reimbursement\nPaid time off\nParental leave\nEmployee assistance program\nVision insurance\n401(k) matching\nLife insurance\nQualifications\nPower BI\nBusiness intelligence\nReact\n5 years\nSQL\nBachelor's degree\nA/B testing\nData visualization\nQuantitative analysis\nSenior level\nCommunication skills\nData manipulation\nAnalytics\nFull Job Description\nJob Description\nThe Role\nWe are seeking a highly skilled and enthusiastic Senior Business Intelligence Engineer to join our Enterprise Data Analytics and Insights team. The ideal candidate will play a crucial role in transforming data into actionable insights for the business. You will lead, design and develop complex data assets such as impactful visualization reports, dashboards and self-service data products to aid decision making. You will collaborate with stakeholders to understand business needs, have a consultative approach and develop quantitative and qualitative solutions, apply predictive/prescriptive modeling to address issues and possess compelling storytelling skills to effectively articulate business insights. You are expected to have strong statistical and business analytics skills, build analytic solutions and support the dynamic needs of the business teams. This role requires flexibility and the ability to thrive in a fast-paced environment with quick turnaround times.\nWhat You'll Do:\nDefine and implement best practices and patterns for creating scalable, high-quality visualizations using Power BI, Dash, and React.\nConduct in-depth s tatistical and quantitative analysis on complex data to develop insights and address business issues.\nCollaborate with stakeholders to identify opportunities and provide rapid analytic solutions as a consultant.\nGain a deep understanding of the business and its domain, think strategically and comprehensively, and effectively communicate complex solutions through storytelling.\nRetrieve data from different source systems, perform ETL operations, handle large volumes of data, and have expertise in Data Bricks, SQL, Power BI or equivalent .\nCollaborate with data analysts, data engineers, data scientists and business stakeholders to understand data requirements and visualization needs.\nWork with cross-functional teams to identify key metrics and KPIs for tracking business performance and progress.\nCollaborate with UX/UI designers to ensure a seamless and user-friendly experience in data visualizations.\nAdditional Job Description\nRequired Qualifications:\nBachelor's degree or higher in C omputer science , Data Science, Information Systems/related field or relevant experience.\n5+ years of experience as a BI Engineer/Data analyst and worked on creation, deployment and management of dashboards and developing business insights and analytics.\nStrong proficiency in SQL, Power BI or equivalent .\nStrong statistical and quantitative analysis skills with the ability to translate complex data into clear insights.\nCompelling story telling skills, s trong knowledge of data visualization best practices, principles, techniques required .\nData Science, Experimentation, Inference, A/B testing, quantitative modeling, ML modeling skills are nice to have.\nUnderstanding of data manipulation and transformation techniques.\nExcellent problem-solving skills and the ability to think critically about data visualization challenges.\nStrong communication skills and a collaborative mindset to work effectively in cross-functional teams .\nAttention to detail and a passion for creating visually compelling and informative data visualizations.\nYou may not check every box, or your experience may look a little different from what we’ve outlined, but if you think you can bring value to our team with your unique experiences and perspectives , we encourage you to apply!\nThis role is based remotely but if you live within a 50-mile radius of [Atlanta, Austin, Detroit, Warren, Milford or Mountain View], you are expected to report to that location three times a week, at minimum.\nThis job is not eligible for relocation benefits. Any relocation costs would be the responsibility of the selected candidate.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\nGM DOES NOT PROVIDE IMMIGRATION-RELATED SPONSORSHIP FOR THIS ROLE. DO NOT APPLY FOR THIS ROLE IF YOU WILL NEED GM IMMIGRATION SPONSORSHIP (e.g., H-1B, TN, STEM OPT, etc.) NOW OR IN THE FUTURE.\n#LI-CC1\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe aspire to be the most inclusive company in the world. We believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Our Work Appropriately philosophy supports our foundation of inclusion and provides employees the flexibility to work where they can have the greatest impact on achieving our goals, dependent on role needs. Every day, we want every employee, no matter their background, ethnicity, preferences, or location, to feel they belong to one General Motors team.\nBenefits Overview\nThe goal of the General Motors total rewards program is to support the health and well-being of you and your family. Our comprehensive compensation plan incudes, the following benefits, in addition to many others:\nPaid time off including vacation days, holidays, and parental leave for mothers, fathers and adoptive parents;\nHealthcare (including a triple tax advantaged health savings account and wellness incentive), dental, vision and life insurance plans to cover you and your family;\nCompany and matching contributions to 401K savings plan to help you save for retirement;\nGlobal recognition program for peers and leaders to recognize and be recognized for results and behaviors that reflect our company values;\nTuition assistance and student loan refinancing;\nDiscount on GM vehicles for you, your family and friends.\nDiversity Information\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities. GM is proud to be an equal opportunity employer.\n\nWe encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.\nEqual Employment Opportunity Statements\nGM is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. GM is committed to providing a work environment free from unlawful discrimination and advancing equal employment opportunities for all qualified individuals. As part of this commitment, all practices and decisions relating to terms and conditions of employment, including, but not limited to, recruiting, hiring, training, promotion, discipline, compensation, benefits, and termination of employment are made without regard to an indivi d ual's protected characteristics. For purposes of this policy, “protected characteristics\" include an individual's actual or perceived race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth, lactation and related medical conditions), gender identity or gender expression, sexual orientation, weight, height, marital status, military service and veteran status, physical or mental disability, protected medical condition as defined by applicable state or local law, genetic information, or any other characteristic protected by applicable federal, state or local laws and ordinances. If you need a reasonable accommodation to assist with your job search or application for employment, email us at Careers.Accommodations@GM.com or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.\nApply Now"
    },
    {
        "Position": "AI Researcher / Engineer",
        "Company": "Moonwalk Biosciences, Inc.",
        "Location": "South San Francisco, CA",
        "Salary": "$102,000 - $270,000 a year",
        "url": "https://www.simplyhired.com/job/CFKG5TTfIxIR2pt5a27UWHF_dUdVAf0F8J6pc9-VWF44Eua4C9qSdg",
        "Job_Description": "AI Researcher / Engineer\nMoonwalk Biosciences, Inc.\nSouth San Francisco, CA\nQuick Apply\nJob Details\nFull-time\n$102,000 - $270,000 a year\n6 days ago\nQualifications\nTensorFlow\nBiology\nDoctoral degree\nComputer Science\nPyTorch\n5 years\nMachine learning\nDoctor of Philosophy\nSenior level\nAI\nFull Job Description\nAI Researcher / Engineer\nOverview:\nMoonwalk Biosciences is recruiting an AI Researcher / Engineer. As a key member of our R&D team, you will help build the Moonwalk Platform for controlled cellular reprogramming. You will develop and test AI models that can provide insight into epigenetic control of cellular functions, and predict the consequences of epigenetic edits.\nKey Responsibilities:\nWork with the R&D team to build large-scale AI foundation models of DNA sequence and epigenetic state\nBuild training and validation datasets from a combination of public data and internally generated data\nHelp design wet lab experiments to generate the most effective model training data, potentially using an active learning approach\nApply AI models to advance Moonwalk’s therapeutic development programs\nRequired Qualifications:\n5+ years of experience working in AI / ML\nProficiency with one or more AI frameworks such as PyTorch or Tensorflow\nProven track record of high-caliber scientific work, e.g., demonstrated through publications in peer-reviewed scientific journals\nAbility to excel in a team-first, supportive work environment, and clearly articulate ideas, problems, and solutions\nPreferred Skills and Experience:\nExperience working at the intersection of biology and AI / ML\nPhD in Computer Science, Machine Learning, Computational Biology or related field\nSalary Ranges:\nEngineer I: The expected annual pay range for this position is $102,000 – $138,000.\nEngineer II: The expected annual pay range for this position is $121,000 – $164,000.\nSenior Engineer: The expected annual pay range for this position is $147,000 – $199,000.\nStaff Engineer: The expected annual pay range for this position is $170,000 – $230,000.\nPrincipal Engineer: The expected annual pay range for this position is $199,000 – $270,000.\nExact compensation and title may vary based on skills and years of experience.\nCompany Overview:\nMoonwalk Biosciences is pioneering a new class of precision epigenetic medicines. Its novel platform technology provides a complete view of the epigenome in health and disease, with the most advanced AI prediction of epigenetic targets, and the broadest set of epigenetic engineering tools. Moonwalk was Co-founded by Alex Aravanis, M.D., Ph.D., former CTO of Illumina, world-renowned scientist Feng Zhang, Ph.D. of the Broad Institute of MIT and Harvard, and a distinguished set of industry leaders and company builders. It has raised $57 million led by Alpha Wave Ventures, and joined by other leading life sciences investors ARCH Venture Partners, Future Ventures, GV, Khosla Ventures and YK Bioventures.\nQuick Apply"
    },
    {
        "Position": "GPU ML Engineer",
        "Company": "Apple",
        "Location": "Waltham, MA",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/ZiIE-nb-f75IS92kWaVgZTO-9Ar_l5Uo2U_TSdKtZl6aLXwRino6ZQ",
        "Job_Description": "GPU ML Engineer\nApple - 4.1\nWaltham, MA\nApply Now\nJob Details\nEstimated: $120K - $152K a year\n8 days ago\nQualifications\nGPU programming\nTensorFlow\nPyTorch\niOS\nMid-level\nMath\nMachine learning\nAPIs\nMac OS\nMachine learning libraries\nFull Job Description\nSummary\n\nPosted: Oct 11, 2024\n\nRole Number:200572765\n\nApple’s Compute Frameworks team in GPU, Graphics and Displays org provides a suite of high-performance data parallel algorithms for developers inside and outside of Apple for iOS, macOS and Apple TV. Our efforts are currently focused in the key areas of linear algebra, image processing, machine learning, along with other projects of key interest to Apple. We are always looking for exceptionally dedicated individuals to grow our outstanding team.\n\nDescription\n\nOur team is seeking extraordinary machine learning and GPU programming engineers who are passionate about providing robust compute solutions for accelerating machine learning networks on Apple Silicon. Role has the opportunity to influence the design of compute and programming models in next generation GPU architectures. Responsibilities: Adding optimizations in machine learning computation graph. Defining and implementing APIs in Metal Performance Shaders Graph, investigating new algorithms. Develop/maintain/optimize ML training acceleration technologies. Support adoption of GPU-accelerated training across 1st and 3rd party clients. Tune GPU-accelerated training across products. Performing in-depth analysis, compiler and kernel level optimizations to ensure the best possible performance across hardware families. Intended deliverables: ML training GPU acceleration technology. Optimized ML training across products. If this sounds of interest, we would love to hear from you!\nProven programming and problem-solving skills.\nGood understanding of machine learning fundamentals.\nGPU compute programming models & optimization techniques.\nGPU compute framework development, maintenance, and optimization.\nMachine learning development using one or more ML frameworks (TensorFlow, PyTorch or JAX).\n\nPreferred Qualifications\nExperience with adding computational graph support, runtime or device backend to Machine learning libraries (TensorFlow, PyTorch or JAX) support.\nExperience with high performance parallel programming, GPU programming or LLVM/MLIR compiler infrastructure.\nExperience with system level programming and computer architecture.\nBackground in mathematics, including linear algebra and numerical methods.\n\nEducation & Experience\n\nAdditional Requirements\n\nMore\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.\nApply Now"
    },
    {
        "Position": "Principal ML Ops Engineer",
        "Company": "Flagship Pioneering, Inc.",
        "Location": "Cambridge, MA",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/ORgVbRy03CFUnSMMz-JaoVoHeSZDv_-_XcAiEgTrhM5VBcpSSKlwjA",
        "Job_Description": "Principal ML Ops Engineer\nFlagship Pioneering, Inc. - 4.0\nCambridge, MA\nQuick Apply\nJob Details\nEstimated: $121K - $154K a year\nQualifications\nTensorFlow\nCI/CD\nBiotechnology\n7 years\nComputer Science\nKubernetes\nPyTorch\nAWS Certification\nGit\nMaster's degree\nAWS\nDocker\nBachelor's degree\nMachine learning\nTerraform\nSenior level\nAI\nCommunication skills\nPython\nFull Job Description\nFlagship Pioneering is a biotechnology company that invents and builds platform companies, each with the potential for multiple products that transform human health or sustainability. We create about six new companies every year and incubate them through successive rounds of funding.\nSince launching in 2000, Flagship has originated and fostered more than 100 scientific ventures, resulting in more than $90 billion in aggregate value.\nMany of the companies that Flagship has founded have addressed humanity's most urgent challenges: vaccinating billions of people against COVID-19, curing intractable diseases, improving human health, preempting illness, and feeding the world by improving the resiliency and sustainability of agriculture.\nFlagship has been recognized twice on FORTUNE's \"Change the World\" list, an annual ranking of companies that have made a positive social and environmental impact through activities that are part of their core business strategies and has been twice named to Fast Company's annual list of the World's Most Innovative Companies. Learn more about Flagship at www.flagshippioneering.com.\nPosition Overview:\nFlagship Pioneering is seeking a Principal ML Ops Engineer to enhance our Digital Science team. This role is centered around building and managing ML applications and solutions, with a particular focus on the development of frameworks to support advanced machine learning models. You will play a vital role in increasing efficiency around deployment of Life Sciences ML models thereby reinforcing Flagship's leadership in AI and ML across diverse domains. You will frequently partner with Flagship Pioneering ML Researchers and Leaders by providing capabilities to train and deploy models.\nKey Responsibilities:\nLead the development and operationalization of ML-powered applications, ensuring their scalability, performance, and reliability.\nDesign and implement best practices in ML Ops to streamline the deployment, monitoring, and maintenance of machine learning models.\nWork closely with the Pioneering Intelligence team to translate cutting-edge AI research into practical, scalable applications.\nDevelop and recommend frameworks and tools to automate the deployment, scaling, and management of AI systems in production environments.\nMentor engineers and contribute to the ML knowledge base within Flagship Pioneering.\nQualifications:\nBachelor's or Master's degree in Computer Science, Engineering, or a related technical field.\n7+ years of experience in software engineering, with at least 3 years focused on ML systems.\nProgramming skills in the Python programming language and common software development tools: Git, testing frameworks, CI/CD, and Docker.\nAWS Certifications or equivalent experience building in the cloud\nDemonstrated experience in designing, building, and maintaining production-level AI/ML applications.\nPrevious experience with the Life Sciences and Biotechnology industry.\nPreferred Qualifications:\nExperience in machine learning tools like PyTorch, Tensorflow, or JAX\nDeveloped infrastructure as code with frameworks such as AWS CDK, CloudFormation, or Terraform.\nExperience with workflow and orchestration tools such as Kubernetes, Dask, Prefect, or Metaflow\nValues and Behaviors:\nWe are seeking individuals with an entrepreneurial spirit, strong communication skills, and comfort working in and contributing to a dynamic and cross-functional team environment. The level of the role will be commensurate with the education and years of experience of the identified candidate.\nFlagship Pioneering and our ecosystem companies are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\nAt Flagship, we recognize there is no perfect candidate. If you have some of the experience listed above but not all, please apply anyway. Experience comes in many forms, skills are transferable, and passion goes a long way. We are dedicated to building diverse and inclusive teams and look forward to learning more about your unique background.\nRecruitment & Staffing Agencies: Flagship Pioneering and its affiliated Flagship Lab companies (collectively, \"FSP\") do not accept unsolicited resumes from any source other than candidates. The submission of unsolicited resumes by recruitment or staffing agencies to FSP or its employees is strictly prohibited unless contacted directly by Flagship Pioneering's internal Talent Acquisition team. Any resume submitted by an agency in the absence of a signed agreement will automatically become the property of FSP, and FSP will not owe any referral or other fees with respect thereto.\n#LI-NM1\nQuick Apply"
    },
    {
        "Position": "Machine Learning Engineer",
        "Company": "Unlimit Ventures",
        "Location": "San Diego, CA",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/YdA9ehEE_FNcKIyQBWzvrSyrfKTHlGMLMOYG8YzVDLqrDG1B8uNEcA",
        "Job_Description": "Machine Learning Engineer\nUnlimit Ventures\nSan Diego, CA\nQuick Apply\nJob Details\nFull-time\nEstimated: $112K - $142K a year\n7 days ago\nQualifications\nTensorFlow\nStatistics\nPyTorch\nData structures\nNumPy\nMid-level\nAlgorithms\nPandas\nAnalysis skills\nMachine learning\nFeature extraction\nSciPy\nComputer networking\nData analytics\nData science\nKeras\nClustering\nMachine learning libraries\nRobotics\nMachine learning frameworks\n2 years\nCommunication skills\nData manipulation\nAnalytics\nFull Job Description\n**Please note - Actively hiring for this position in the San Diego, CA area**\nAs a Machine Learning Engineer, you will play a critical role in developing cutting-edge models and algorithms that transform data into actionable insights. You will collaborate with cross-functional teams, work on challenging projects, and work building one of our new exciting products in the environmental devices industry. This role is a contractor role, with strong opportunities for permanent hiring and growth.\nIf you have a strong foundation in machine learning frameworks, data manipulation, and model optimization, and are eager to apply your skills in a fast-paced, innovative environment, we would love to hear from you.\n\nOur values:\nPrudent optimism …glass-half-full, with a dose of caution to challenge our assumptions.\nIntrinsic motivation …driven by autonomy, goal clarity, and regular feedback.\nCommit to desired outcomes …define desired outcomes and achieve them vigorously.\nNo egos, no jerks …no joke.\n\n\nYou will be responsible for:\nExpertise in ML frameworks and common ML libraries (TensorFlow, Keras, PyTorch, etc.).\nExpertise in data manipulation and analysis skills. Should be comfortable with affiliated libraries (Pandas, NumPy, SciPy, etc.).\nUnderstanding of a wide range of ML algorithms (SVMs, neural networks, clustering algorithms, etc.) and ensemble methods.\nExperience with selecting appropriate models for various tasks, and understanding of how to improve models given their performance evaluations.\nExpertise in feature selection, feature extraction, and feature engineering.\nDeep learning expertise (knowledge of designing and implementing multiple neural network architectures, experience with transfer learning techniques, proficiency in tuning hyperparameters).\nData science skills (data analytics and visualization).\n\nQualifications:\n\n2 to 5 years relevant industry experience with Machine Learning, Statistics, Data Engineering, or similar\nExperience with device development, robotics preferred\nStrong understanding of data structures or algorithms\nFamiliar with hybrid models that integrate multiple data sources\nExperienced with FCNNs (fully connected neural networks) and pre-trained CNNs\nComfortable with feature engineering, especially for unconventional classification models\nExperienced with a wide range of modeling approaches such as SVMs and clustering algorithms\n\nPreferred skills:\nExperience taking ideas from inception to launch\nUnderstanding of product market fit, user experience, analytics, metrics and testing\nExperience working with highly scalable, fault-tolerant, secure and compliant architecture and systems\nStrong communication skills and bias for action\nFamiliar with holographic data processing\nQuick Apply"
    },
    {
        "Position": "AI / ML Developer",
        "Company": "DuploCloud",
        "Location": "San Francisco Bay Area, CA",
        "Salary": "$170,000 - $190,000 a year",
        "url": "https://www.simplyhired.com/job/tsG-FmXlCBq7dhEGoY2pMQr4h60zyPKFHW4r3-BdhCFasmaOtgdO2w",
        "Job_Description": "AI / ML Developer\nDuploCloud\nSan Francisco Bay Area, CA\nQuick Apply\nJob Details\n$170,000 - $190,000 a year\n11 hours ago\nBenefits\nHealth savings account\nHealth insurance\nDental insurance\nFlexible spending account\nEmployee assistance program\nVision insurance\nQualifications\nAI chatbots\n5 years\nDevOps\nGoogle Cloud Platform\nAWS\nMachine learning\nFeature extraction\nAPIs\nSenior level\nAI\nEmployee evaluation\nPython\nFull Job Description\nAbout DuploCloud:\nDuploCloud is a software platform that allows engineering teams to achieve their infrastructure automation, security and compliance goals by offering DevOps-as-a-Service. We strive to make DevOps and Infrastructure-as-Code accessible for everyone; where application developers can focus on building applications rather than writing thousands of lines of code to automate well known operational workflows and compliance standards. DuploCloud is a venture backed company, Series-B funded by Mayfield Fund, WestBridge Capital and StepStone Group.\nAbout the role:\nDuploCloud is looking for an AI / ML Developer with a demonstrated background in developing AI applications and a passion for working on the cutting edge of AI capabilities. The role involves working in our AI Growth Team and working closely with our Onboarding team, Operations Team, and our customers. This role will contribute significantly to the growth trajectory of the company by creating AI solutions for a captive audience of existing DuploCloud customers.\nYou will be a strong fit for this role if you have experience …\nDesigning, developing, and optimizing machine learning models to solve specific business problems. This includes feature engineering, model selection, hyperparameter tuning, and performance evaluation.\nWorking with large datasets, ensuring data quality, cleaning, and preprocessing.\nDeploying machine learning models into production environments.\nDevelop APIs or integrate models with existing software applications.\nEnsuring models are scalable and perform well in a production environment, considering factors such as latency, throughput, and resource utilization.\nConducting experiments to validate model assumptions, fine-tune algorithms, and evaluate the performance of different approaches.\nWorking closely with cross-functional teams, including data scientists, software engineers, product managers, and business analysts, to understand requirements and deliver solutions.\nDocumenting models, processes, and systems to ensure clarity and maintainability.\nStaying up-to-date with the latest developments in machine learning, AI, and related fields. Apply new techniques and tools to improve models and processes.\nMonitoring models in production to ensure they perform as expected over time. Retrain models as needed and address any issues that arise.\nQualifications:\n5+ years of demonstrated ability as a Python developer\n5+ years of demonstrated ability working on AI/ML use cases\nExperience working with both customers and internal teams to collect requirements, troubleshoot issues, and identify new uses cases\nDynamic team member who will both teach and learn from all of us on the Growth Team\nProblem solver who can interpret sophisticated problem statements, boil them down into simple solutions, and collaborate with customers and other teams\nComfortable in both a business and technical context, working with executives or talking shop with technical audiences\nOpen to giving and receiving feedback, tolerate failure and are passionate about making clients successful\nStrong knowledge of LLMs provided by Cloud Providers (AWS, Azure, GCP)\nStrong knowledge of LLMs provided by private companies (open.ai, Anthropic, etc)\nStrong knowledge of RAG\nStrong knowledge of building AI based chatbots and incorporating Agent/Assistant capabilities into the chatbot\nMust have previous DevOps experience\nMust have previous AWS experience\n\nBenefits:\nRemote flexible work options\nEmployee assistance program (EAP)\nMedical, dental & vision benefits supplement\nLife & supplement life and Critical illness insurance\nHealth Savings Account (HSA), Flexible Savings Account (FSA)\nNote: DuploCloud Inc. is an Equal Opportunity Employer that does not discriminate on the basis of race, color, religion, gender, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or any other protected class. If you have a disability or special need that requires accommodation, please contact us at careers@duplocloud.net.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider employment-qualified applicants with arrest and conviction records.\nThis role has been categorized as a Remote position. \"Remote\" employees do not have a permanent corporate office workplace and, instead, work from a physical location of their choice which must be identified to the Company. Employees may live in any of the 50 US States, with limited exceptions. In certain cases, an employee in a remote-designated job may need to live in a specific region or time zone to support customers or clients as part of their role.\nThe pay listed above is specific to California, Colorado, Connecticut, Maryland, Nevada, New York, Rhode Island, and Washington. The standard base pay range listed for this role may not be applicable to other locations.\nApplicants may be required to sign a confidentiality agreement during the interview process. Applicants who receive job offers from DuploCloud Inc. will be asked to sign a confidentiality agreement, intellectual property disclosure, customer and employee non-solicitation, and non-competition provisions. If you are contacted for a role at DuploCloud Inc. and wish to review a copy of the required documents prior to receiving an offer, you may request a copy from your Recruiter.\nQuick Apply"
    },
    {
        "Position": "Data Engineer - Official AI",
        "Company": "Pioneer Square Labs",
        "Location": "Seattle, WA",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/sv67S1ptv95rHJwOMP6wZpW2yjXNFpqyG0o3o3-x9rVr__owZm9j8A",
        "Job_Description": "Data Engineer - Official AI\nPioneer Square Labs\nSeattle, WA\nQuick Apply\nJob Details\nEstimated: $131K - $166K a year\n1 day ago\nQualifications\nAI models\nRapid prototyping\nTensorFlow\nCI/CD\nGAN\nComputer Science\nKubernetes\nPyTorch\nComputer vision\nBig data\nSpark\nGit\nGoogle Cloud Platform\nMid-level\n3 years\nMaster's degree\nAlgorithms\nAWS\nDocker\nBachelor's degree\nMachine learning\nDistributed systems\nDeep learning\nData science\nDistributed computing\nAI\nCommunication skills\nPython\nData Science\nHadoop\nFull Job Description\nJob Description: Data Engineer - AI Image Generation Specialist\nOfficial AI is revolutionizing the landscape of AI-powered content creation, collaboration, and protection. Our mission is to build an ecosystem for authenticity that ignites the next creative renaissance. We're creating a new market where talent and brands thrive in the era of generative AI, where authentic content is valued, easily identified, and protected in AI-generated media.\nWe're seeking an innovative and passionate Data Engineer with expertise in AI image generation to join our cutting-edge team. The ideal candidate will play a crucial role in developing and optimizing our AI models, with a focus on pushing the boundaries of image generation technology. This position offers a unique opportunity to shape the future of authentic AI-generated content in a fast-paced startup environment.\nKey Responsibilities:\nDesign, develop, and maintain scalable data pipelines and infrastructure for AI image generation models\nExperiment with and implement advanced techniques in image generation, including depth mapping, control nets, and other emerging methodologies\nCollaborate with cross-functional teams to integrate AI models into our product ecosystem\nOptimize model performance and efficiency, ensuring high-quality output at scale\nDevelop and implement quality assessment algorithms for AI-generated images\nStay at the forefront of AI image generation research and incorporate new techniques into our workflow\nContribute to the development of our proprietary AI models and open-source initiatives\nQualifications:\nBachelor's or Master's degree in Computer Science, Data Science, or related field\n3+ years of experience in data engineering, machine learning, or AI development\nProven expertise with open-source image generation tools such as Stable Diffusion, Flux\nExperience with depth mapping, control nets, and other advanced image generation techniques\nStrong programming skills in Python, with experience in deep learning frameworks (e.g., PyTorch, TensorFlow)\nFamiliarity with distributed computing and big data technologies (e.g., Apache Spark, Hadoop)\nExperience with version control systems (e.g., Git) and CI/CD pipelines\nKnowledge of cloud platforms (AWS, GCP, or Azure) and containerization technologies (Docker, Kubernetes)\nPreferred Qualifications:\nExperience in pattern matching and computer vision algorithms\nBackground in rapid prototyping and experimentation with AI models\nFamiliarity with generative adversarial networks (GANs) and diffusion models\nContributions to open-source projects or research publications in AI/ML\nPersonal Qualities: Aligned with our core values, we're looking for someone who embodies:\nIntegrity: Demonstrates honesty, transparency, and ethical decision-making in all aspects of work\nDrive: Sets ambitious goals and shows determination in tackling complex challenges\nTrust: Fosters open communication and is willing to have difficult conversations for the benefit of the team\nTeamwork: Collaborates effectively, leaving ego at the door and celebrating collective successes\nAdditionally, we value:\nCuriosity and a passion for continuous learning in the rapidly evolving field of AI\nCreativity in applying unconventional approaches to solve complex problems\nAdaptability to thrive in a fast-paced startup environment\nStrong communication skills to explain complex technical concepts to non-technical team members\nWhy Join Official AI:\nBe at the forefront of AI innovation, working on cutting-edge image generation technology\nOpportunity to make a significant impact in a high-growth startup environment\nCollaborate with a talented and passionate team dedicated to authenticity in AI-generated content\nContribute to the development of ethical AI practices that will shape the future of creative industries\nCompetitive compensation package including equity\nAt Official AI, we're committed to building a diverse and inclusive team. We encourage applications from individuals with a wide range of backgrounds and experiences. If you're passionate about pushing the boundaries of AI image generation and want to be part of a mission-driven company, we want to hear from you!\nTo apply, please submit your resume, a portfolio of relevant projects (if available), and a brief statement explaining why you're excited about this role and how you align with our mission and values.\nQuick Apply"
    },
    {
        "Position": "Founding Engineer - Senior Software Engineer (Ai/ML)",
        "Company": "G2M Talent",
        "Location": "San Francisco Bay Area, CA",
        "Salary": "$160,000 - $220,000 a year",
        "url": "https://www.simplyhired.com/job/iBtg3UF9aJfCXC9mGbCeAy-FEYL9084LzAo8ItRi-mPZewHF5IM1gw",
        "Job_Description": "Founding Engineer - Senior Software Engineer (Ai/ML)\nG2M Talent\nSan Francisco Bay Area, CA\nQuick Apply\nJob Details\nFull-time\n$160,000 - $220,000 a year\n6 days ago\nBenefits\nHealth insurance\nDental insurance\n401(k)\nPaid time off\nVision insurance\nQualifications\n6 years\nLaw\nKubernetes\nText-to-speech\nJavaScript\nPostgreSQL\nDistributed systems\nNext.js\nSenior level\nAI\nTypeScript\nPython\nFull Job Description\nWe're a young, high-velocity tech startup focused on AI-driven automation. After experiencing explosive growth last month (8x revenue jump), we’re on the hunt for a core engineer to join early and help us accelerate even faster.\nWhat You'll Do\nFrom Zero to One: Launch new, high-impact tools that improve the performance and reliability of AI-based systems. Customer requests are rolling in fast, and we need someone who can turn ideas into solutions quickly.\nScaling for the Future: Optimize and expand existing infrastructure to handle exponential growth—automating processes and building reliable platforms that can support a large customer base.\nIdeal Background\nExperience as an ex-founder or early-stage engineer in startups\nSkilled in using next-gen coding tools (e.g., Cursor, Zed)\nSolid understanding of large language models (LLMs) and future model capabilities\nComfortable working in both early product development and scaling for high reliability\nAble to iterate rapidly based on customer feedback while maintaining high code quality\nBonus Skills\nExperience building AI-powered voice tools\nFamiliar with prompt optimization, model evaluations, or observability frameworks\nWorked on distributed systems or real-time platforms like telecom networks, autonomous systems, or high-frequency trading platforms\nTech Stack\nFrontend/Backend: TypeScript, Next.js, Python\nAI Tools: OpenAI, Anthropic, STT, TTS\nInfra: PostgreSQL, Kubernetes\nJob Type: Full-time\nPay: $160,000.00 - $220,000.00 per year\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nSchedule:\n8 hour shift\nDay shift\nMonday to Friday\nExperience:\nSoftware Engineering - LLM/Ai: 6 years (Required)\nWork Location: In person\nQuick Apply"
    },
    {
        "Position": "Staff Software Engineer, Applied ML",
        "Company": "Character.AI",
        "Location": "Menlo Park, CA",
        "Salary": "$150,000 - $250,000 a year",
        "url": "https://www.simplyhired.com/job/KUldZBIxKrHYqZsBCBaN-4rFBd6DYpJU0KMQAhbWuMBfpsToFUjyOw",
        "Job_Description": "Staff Software Engineer, Applied ML\nCharacter.AI - 4.2\nMenlo Park, CA\nQuick Apply\nJob Details\nFull-time\n$150,000 - $250,000 a year\nQualifications\nTensorFlow\nCI/CD\nComputer science\nPyTorch\n5 years\nTest automation\nGoogle Cloud Platform\nDatabases\nAWS\nBachelor's degree\nREST\nModel training\nSenior level\nAI\nAssociate's degree\ngRPC\nMachine learning frameworks\nBachelor of Arts\nFull Job Description\nAbout the Role\nAs a Software Engineer you will work cross functionally with product, data science, data platform and ML researchers to identify, design and implement the applied ML infra, ranging from the data pipeline to model training and serving infrastructure, on one of the fastest growing consumer applications on the market today. You will lead implementation of our ML backend systems to support new parts of our product while working with the team to support scaling our existing systems.\nRequirements:\nB.A.S. in Computer Science or equivalent experience.\n5+ years of industry experience\nExperience building/consuming RESTful and gRPC based web-services\nExperience building and managing infrastructure in a cloud environment (GCP, AWS or Azure)\nFamiliar with one of the popular ML Frameworks like Pytorch, Tensorflow\nExperience writing highly performant service in a modern typed language\nExperience configuring and maintaining CI/CD pipelines and automated testing\nDesired Experience:\nExperience with shipping intelligent features, end-to-end, and from idea to production\nExperience with understanding, designing or implementing a full pipeline from data ingestion to model training.\nExperience with production AI/ML systems and services including optimizing GPU/TPU deployments\nExperience working with vector databases or other feature storage\nYou will be a good fit if you are proactive and have a “get things done” mindset. Given our current pace of growth and load on our systems, most people have had a significant impact during their first week at the company.\nAbout Character.AI\nFounded in 2021, Character is a leading AI company offering personalized experiences through customizable AI 'Characters.' As one of the most widely used AI platforms worldwide, Character enables users to interact with AI tailored to their unique needs and preferences.\nIn just two years, we achieved unicorn status and were named Google Play's AI App of the Year – a testament to our groundbreaking technology and vision.\nReady to shape the future of Consumer AI?\n\nAt Character, we value diversity and welcome applicants from all backgrounds. As an equal opportunity employer, we firmly uphold a non-discrimination policy based on race, religion, national origin, gender, sexual orientation, age, veteran status, or disability. Your unique perspectives are vital to our success.\nCompensation Range: $150K - $250K\nQuick Apply"
    },
    {
        "Position": "2024-01-1E AI/ML Engineer",
        "Company": "1st Edge, LLC",
        "Location": "Huntsville, AL",
        "Salary": "Not specified",
        "url": "https://www.simplyhired.com/job/GV1tFzx-nnHeo94NE64C-trJhdHodVgYeXOIAdnMaEnTclmCvy7_og",
        "Job_Description": "2024-01-1E AI/ML Engineer\n1st Edge, LLC\nHuntsville, AL\nQuick Apply\nJob Details\nFull-time\nEstimated: $105K - $133K a year\n2 days ago\nQualifications\nReinforcement learning\nDoctoral degree\nComputer Science\nSoftware Engineering\nPyTorch\nSoftware deployment\nBachelor of Science\nEngineering\nGit\nMid-level\nMaster's degree\nAnalysis skills\nDocker\nBachelor's degree\nMachine learning\nDoctor of Philosophy\nModel deployment\nVirtualization\nComputer Engineering\nNatural language processing\nModel training\nAI\n4 years\nGitLab\nPython\nMLOps\nFull Job Description\n1st Edge is a growing business seeking top performers to join in our mission of developing Artificial Intelligence solutions for our Government customers. We offer technically advanced, challenging work in an employee-centered environment driven by the desire to contribute to a meaningful purpose. Our employees work closely with Space and Missile Defense Command (SMDC), Missile Defense Agency (MDA), and Combat Capabilities Development Command (DevCom).\nWe believe in a balanced, quid pro quo relationship between the company and its employees, providing all benefits at no cost-plus generous time off. This balanced culture allows employees to do their best work and contributes to our extraordinary success rate. From an excellent benefits package to job autonomy with challenging work, 1st Edge cultivates an innovative and collaborative environment with meaningful work.\n1st Edge is seeking a skilled and experienced Senior AI/ML Engineer to join our team. In this position, you will play a vital role in developing and integrating cutting-edge solutions using AI/ML technologies for use in a variety of applications. You will be instrumental in the design, development, and deployment of AI models and systems for 1st Edge. This position is on-site at 1st Edge LLC, located in Huntsville, AL.\nResponsibilities include, but are not limited to the following tasks:\nLead the development of AI solutions using machine learning, deep learning, natural language processing, and computer vision\nDevelop and maintain AI systems, including data pipelines, model training, and deployment\nCollaborate with data scientists, software engineers, and integrated product team stakeholders to integrate AI solutions\nProvide reports and briefings on AI/ML model performance to government partners\nMentor junior engineers and contribute to the growth of the team\nCollaborate with team to writing technical papers and white papers\nEssential job skills include:\nAbility to apply AI techniques in a variety of contexts\nExperience working with MLOps for experiment tracking and model deployment\nStrong proficiency in Python and associated packages such as Pytorch\nExcellent problem-solving and analytical skills\nAbility to work independently and as part of a team\nPrepare presentations and reports to communicate complex technical concepts to a broad audience\nDesired qualifications:\nExperience with AI techniques for Reinforcement Learning\nKnowledge of Git/Gitlab and virtualization technologies such as Docker\nRequired qualifications:\n4+ years of related experience\nYou must be a U.S. Citizen and have, or be able to obtain, a secret security clearance.\nEducation Requirements:\nBachelor of Science/Engineering degree in computer science, computer engineering, software engineering, mathematics, or related discipline\nMaster's Degree or Ph.D. preferred\nQuick Apply"
    },
    {
        "Position": "Senior ML Engineer, Embodied AI",
        "Company": "Serve Robotics",
        "Location": "Remote",
        "Salary": "$150,000 - $200,000 a year",
        "url": "https://www.simplyhired.com/job/Om1Yc1_l2VCG8JRMBynvufSpBma52LxjxJ2EZazHAis7-xG8xc1nTg",
        "Job_Description": "Senior ML Engineer, Embodied AI\nServe Robotics\nRemote\nQuick Apply\nJob Details\nFull-time\n$150,000 - $200,000 a year\n7 days ago\nQualifications\nTensorFlow\nDoctoral degree\nKubernetes\nPyTorch\nComputer vision\n5 years\nSoftware deployment\nGoogle Cloud Platform\nSQL\nAWS\nDocker\nMachine learning\nDoctor of Philosophy\nDeep learning\nETL\nData science\nSenior level\nAI\nRobotics\nCommunication skills\nSensors\nMLOps\nFull Job Description\nServe Robotics aims to develop dependable and proficient sidewalk autonomy software. Our Perception & Prediction team is looking for a talent in identified research areas such as artificial intelligence, robotics, and embodied AI, particularly including areas such as representation learning for Embodied AI tasks, end-to-end learning, vision-language-action models, contextually aware AI.\nKey Responsibilities\nPioneer the development of embodied intelligence for robotics, enabling unprecedented generalization across diverse environments and embodiments.\nInvent/improve novel data-driven paradigms for embodied intelligence, leveraging a variety of modalities (images, video, point clouds (Lidar), text, audio etc).\nCreate business impactful solutions to improve human robot interaction through embodied intelligence.\nWork with ML infrastructure engineers to assess and monitor model performance, ideate on active learning framework from long tail problems and pave innovative solutions to handle generalization capabilities from being data aware.\nCollaborate with various teams to understand real-world problems and define tasks, incorporating insights into ML products.\nQualifications\nMS with 5 years of industry experience or PhD with minimum 3 years of industry experience with focus in embodied intelligence, AR/VR , Robotics use-cases in a end-to-end learning framework.\nDemonstrated leadership in scientific efforts, with contributions to top rated conferences and journals.\nExperience with deep learning frameworks (such as pytorch, tensorflow) and computational data science libraries.\nExperience with using large-scale datasets and sensor data, with use of various transformer architectures and diffusion models.\nAdept with latest technology trends in AI / Robotics and Foundational models. Deep understanding of computer vision, machine learning and deep learning basic concepts.\nComfortable working with SQL queries and ETL logic for data ingress.\nStrong programming skills for efficient and robust code.\nExperience with multiple sensors such as Lidar, Mono/Stereo cameras, IMU, etc.\nStrong communication skills.\nWhat makes you standout\nHands-on experience with fine-tuning LLMs or vision-language models and their performance challenges and opportunities.\nExperience with MLOps or ML Infrastructure, ability to streamline machine learning workflows.\nFamiliarity with edge-device perception stack deployment, experience with NVIDIA software libraries such as CUDA or TensorRT.\nOpen source project contributor.\nExperience with GCP or AWS, Kubernetes and Docker.\nHiring locations\nCurrently, we are only hiring US and Canada residents, even for remote jobs.\nMore about us\nServe Robotics is the team that created the Postmates delivery robot and brought it to life in LA, completing tens of thousands of deliveries in LA’s busiest neighborhoods. Now we're an independent company growing rapidly in order to connect people with what they need via robots designed to serve people.\nWe are proud to be an equal employment opportunity and affirmative action employer. Qualified applicants are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.\nSee Serve in action\nServe at TED 2020 main stage\nCompensation Range: $150K - $200K\nQuick Apply"
    }
]